In [7]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sn

In [8]:
#importing the Dataset
file = "FoodBalanceSheets_E_Africa_NOFLAG.csv"
df = pd.read_csv(file,encoding="latin-1")

In [9]:
df.head()

,Area Code,Area,Item Code,Item,Element Code,Element,Unit,Y2014,Y2015,Y2016,Y2017,Y2018
0,4,Algeria,2501,Population,511,Total Population - Both sexes,1000 persons,38924.00,39728.00,40551.00,41389.00,42228.00
1,4,Algeria,2501,Population,5301,Domestic supply quantity,1000 tonnes,0.00,0.00,0.00,0.00,0.00
2,4,Algeria,2901,Grand Total,664,Food supply (kcal/capita/day),kcal/capita/day,3377.00,3379.00,3372.00,3341.00,3322.00
3,4,Algeria,2901,Grand Total,674,Protein supply quantity (g/capita/day),g/capita/day,94.90,94.35,94.72,92.82,91.83
4,4,Algeria,2901,Grand Total,684,Fat supply quantity (g/capita/day),g/capita/day,80.06,79.36,77.40,80.19,77.28

In [158]:
df.shape

(60943, 12)

In [17]:
df[['Y2017', 'Area']].groupby('Area').sum().sort_values(by='Y2017')

                                  Y2017
Area
Sudan (former)                     0.00
Ethiopia PDR                       0.00
Comoros                           59.84
Seychelles                       442.34
Sao Tome and Principe          12662.63
Cabo Verde                     14650.74
Guinea-Bissau                  19102.77
Lesotho                        21267.96
Botswana                       22101.30
Djibouti                       22729.91
Gambia                         23154.18
Gabon                          27979.64
Liberia                        29342.20
Namibia                        29874.89
Central African Republic       29937.00
Congo                          41181.68
Togo                           49841.88
Mauritius                      51114.83
Eswatini                       54343.33
Sierra Leone                   55311.33
Chad                           71594.68
Rwanda                         73663.69
Zimbabwe                       75919.34
Senegal                        95681.15
Guinea                         98138.87
Burkina Faso                  101855.07
Zambia                        103223.77
Tunisia                       124167.20
Benin                         124771.22
Niger                         126707.58
Madagascar                    131197.73
Mali                          149928.33
Mauritania                    156665.46
Mozambique                    161407.98
Malawi                        181098.71
Uganda                        213950.38
Côte d'Ivoire                 224599.01
Angola                        229159.57
Cameroon                      232030.43
Sudan                         239931.92
Kenya                         264660.66
United Republic of Tanzania   322616.85
Algeria                       325644.27
Ghana                         337599.06
Morocco                       388495.36
Ethiopia                      448683.76
South Africa                  517590.54
Egypt                         866379.92
Nigeria                      1483268.23

In [18]:
# Getting the seventh lowest sum in 2017 after the grouping
df[['Y2017', 'Area']].groupby('Area').sum().sort_values(by='Y2017').index[6]

'Guinea-Bissau'

In [19]:
df.describe(include='all')

,Area Code,Area,Item Code,Item,Element Code,Element,Unit,Y2014,Y2015,Y2016,Y2017,Y2018
count,60943.000000,60943,60943.000000,60943,60943.000000,60943,60943,59354.000000,59395.000000,59408.000000,59437.000000,59507.000000
unique,NaN,49,NaN,119,NaN,18,5,NaN,NaN,NaN,NaN,NaN
top,NaN,Kenya,NaN,Milk - Excluding Butter,NaN,Domestic supply quantity,1000 tonnes,NaN,NaN,NaN,NaN,NaN
freq,NaN,1560,NaN,1262,NaN,5295,40933,NaN,NaN,NaN,NaN,NaN
mean,134.265576,NaN,2687.176706,NaN,3814.856456,NaN,NaN,134.196282,135.235966,136.555222,140.917765,143.758381
std,72.605709,NaN,146.055739,NaN,2212.007033,NaN,NaN,1567.663696,1603.403984,1640.007194,1671.862359,1710.782658
min,4.000000,NaN,2501.000000,NaN,511.000000,NaN,NaN,-1796.000000,-3161.000000,-3225.000000,-1582.000000,-3396.000000
25%,74.000000,NaN,2562.000000,NaN,684.000000,NaN,NaN,0.000000,0.000000,0.000000,0.000000,0.000000
50%,136.000000,NaN,2630.000000,NaN,5142.000000,NaN,NaN,0.090000,0.080000,0.080000,0.100000,0.070000
75%,195.000000,NaN,2775.000000,NaN,5511.000000,NaN,NaN,8.340000,8.460000,8.430000,9.000000,9.000000
max,276.000000,NaN,2961.000000,NaN,5911.000000,NaN,NaN,176405.000000,181137.000000,185960.000000,190873.000000,195875.000000

In [99]:
# Year 2017 mean
round(df['Y2017'].mean(), 2)

140.92

In [100]:
# Year 2017 standard deviation
round(df['Y2017'].std(), 2)

1671.86

In [26]:
my_tuppy = (1,2,5,8)

my_tuppy[2] = 6

# Turples are immutable

TypeError: 'tuple' object does not support item assignment

In [34]:
#Question 6
df[['Y2017', 'Area']].groupby('Area').sum().sort_values('Y2017').index[-1]

'Nigeria'

In [47]:
# Question 9 -- 
print('The total number of processing in 2017 is')
df.groupby(['Element'])['Y2017'].sum().sort_values()['Processing']

292836.0

In [149]:
#Question 13 -- Number of Unique Countries
print('The number of unique countries is:')
df.Area.nunique()

The number of unique countries is:

49

In [87]:
# Question 11

lst = [[35, 'Portugal', 94], [33, 'Argentina', 93], [30 , 'Brazil', 92]]

col = ['Age','Nationality','Overall']

pd.DataFrame(lst, columns=col, index=[i for i in range(1,4)])

   Age Nationality  Overall
1   35    Portugal       94
2   33   Argentina       93
3   30      Brazil       92

In [143]:
#Question 18
print('The total number of missing data in 2018 is:')
df.Y2014.isnull().sum()

The total number of missing data in 2018 is:

1589

In [150]:
print('The percentage of the missing data in 2018 is:')
total_null_Y14 = df.Y2014.isnull().sum()
null_percent = (total_null_Y14 / len(df.Y2014)) * 100
round(null_percent, 3)

The percentage of the missing data in 2018 is:

2.607

In [148]:
# Question 16
print('The year has the highest sum of Stock Variation is 2014')
df.groupby('Element').sum().loc['Stock Variation'].sort_values()

The year has the highest sum of Stock Variation is 2014

C:\Users\Imago DEI\AppData\Local\Temp\ipykernel_6408\918430107.py:3: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby('Element').sum().loc['Stock Variation'].sort_values()

Y2018              20577.91
Y2016              33140.12
Y2015              34910.99
Y2017              54316.91
Y2014              58749.83
Area Code         571566.00
Item Code       11329527.00
Element Code    21464704.00
Name: Stock Variation, dtype: float64

In [136]:
# Question -15
df.corr()['Element Code'].sort_values()

C:\Users\Imago DEI\AppData\Local\Temp\ipykernel_6408\1077249258.py:1: FutureWarning: The default value of numeric_only in DataFrame.corr is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.corr()['Element Code'].sort_values()

Item Code      -0.024683
Area Code      -0.000209
Y2016           0.023444
Y2015           0.023889
Y2017           0.024254
Y2018           0.024279
Y2014           0.024457
Element Code    1.000000
Name: Element Code, dtype: float64

In [141]:
# Question - 20
S = [['him', 'sell'], [90, 28, 43]]

S[0][1][1]

'e'

In [198]:
 Question 19
    df.query("Area == 'Madagascar' and Element == 'Protein supply quantity (g/capita/day)'")['Y2015'].sum()

173.04999999999998